__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_input (InputLayer)         (None, 240)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 240)          0                                            
__________________________________________________________________________________________________
pred_input (InputLayer)         (None, 240)          0                                            
__________________________________________________________________________________________________
word_emb (Embedding)            (None, 240, 50)      853600      word_input[0][0]                 
__________________________________________________________________________________________________
pre_word_input (InputLayer)     (None, 240, 50)      0                                            
__________________________________________________________________________________________________
pos_emb (Embedding)             (None, 240, 25)      850         pos_input[0][0]                  
__________________________________________________________________________________________________
pred_emb (Embedding)            (None, 240, 50)      853600      pred_input[0][0]                 
__________________________________________________________________________________________________
total_input (Concatenate)       (None, 240, 175)     0           word_emb[0][0]                   
                                                                 pre_word_input[0][0]             
                                                                 pos_emb[0][0]                    
                                                                 pred_emb[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 240, 175)     0           total_input[0][0]                
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 240, 268)     332320      dropout_1[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 240, 268)     432016      bidirectional_1[0][0]            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 240, 268)     0           bidirectional_2[0][0]            
__________________________________________________________________________________________________
Dense (TimeDistributed)         (None, 240, 67)      18023       dropout_2[0][0]                  
__________________________________________________________________________________________________
Softmax (TimeDistributed)       (None, 240, 67)      0           Dense[0][0]                      
__________________________________________________________________________________________________
CRF (CRF)                       (None, 240, 67)      9179        Softmax[0][0]                    
==================================================================================================
Total params: 2,499,588
Trainable params: 2,499,588
Non-trainable params: 0
__________________________________________________________________________________________________
